{
    "film_id": 242900,
    "film_name": "Deadpool 2",
    "version_type": "Standard",
    "images": {
        "poster": {
            "1": {
                "image_orientation": "portrait",
                "region": "US",
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l1.jpg",
                    "width": 333,
                    "height": 500
                },
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h1.jpg",
                    "width": 200,
                    "height": 300
                }
            }
        },
        "still": {
            "2": {
                "image_orientation": "landscape",
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l2.jpg",
                    "width": 500,
                    "height": 333
                },
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h2.jpg",
                    "width": 300,
                    "height": 200
                }
            },
            "3": {
                "image_orientation": "landscape",
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l3.jpg",
                    "width": 500,
                    "height": 333
                },
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h3.jpg",
                    "width": 300,
                    "height": 200
                }
            },
            "4": {
                "image_orientation": "landscape",
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h4.jpg",
                    "width": 300,
                    "height": 200
                },
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l4.jpg",
                    "width": 500,
                    "height": 333
                }
            },
            "5": {
                "image_orientation": "landscape",
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h5.jpg",
                    "width": 300,
                    "height": 200
                },
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l5.jpg",
                    "width": 500,
                    "height": 333
                }
            },
            "6": {
                "image_orientation": "landscape",
                "large": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900l6.jpg",
                    "width": 500,
                    "height": 333
                },
                "medium": {
                    "film_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h6.jpg",
                    "width": 300,
                    "height": 200
                }
            }
        }
    },
    "synopsis_long": "After surviving a near fatal bovine attack, a disfigured cafeteria chef (Wade Wilson) struggles to fulfill his dream of becoming Mayberry's hottest bartender while also learning to cope with his lost sense of taste. Searching to regain his spice for life, as well as a flux capacitor, Wade must battle ninjas, the yakuza, and a pack of sexually aggressive canines, as he journeys around the world to discover the importance of family, friendship, and flavor - finding a new taste for adventure and earning the coveted coffee mug title of World's Best Lover.",
    "distributor_id": 2160,
    "distributor": "Fox Int'l",
    "release_date": "2018-05-15",
    "age_rating": "15 ",
    "age_advisory": "strong bloody violence, sex references, very strong language",
    "duration_mins": 119,
    "review_stars": 3,
    "review_txt": "Two years after its release, the impressions that linger about the original Deadpool are its snarkiness and audacity. The story itself is hard to recall, in large part because it was one of the least impressive aspects of a production that was more interested in offering a Mad Magazine-type superhero movie than meekly regurgitating the genre's tropes. The film's success guaranteed from the outset that there would be a sequel, but therein lay the problem: movies like this, that capture lightning in a bottle, rarely beget a memorable separate chapter. One needs to look no farther than Crocodile Dundee for an example of a high-profile debacle along those lines. The question never was whether Deadpool 2 would be better than Deadpool but whether it would be good enough to avoid embarrassing everyone involved.\n\nFortunately, Ryan Reynolds and his creative team have avoided the pothole by steering around it using a \"more of the same\" approach. Deadpool 2 feels like a continuation of the first film (although one not necessarily committed to tying up plot holes - Angel Dust's fate remains a mystery). Despite lacking the freshness of 2016 feature, the sequel is funny, energetic, and determined not to take itself seriously (even when serious things happen). Do the filmmakers try too hard at times? Yes - burdened by expectations, how could they not? But the movie is sufficiently engaging to deflect most of the serious criticisms. The bottom line is that viewers who enjoyed Deadpool will almost certainly enjoy Deadpool 2, although perhaps not quite as much. \n\nWith Deadpool's director, Tim Miller, departing due to \"creative differences,\" former stuntman David Leitch, whose previous credits include John Wick and Atomic Blonde, stepped in. There's a little of the John Wick style here but it's apparent that the strongest creative influence is that of Reynolds (who gets a shared writing credit). (Not surprisingly, there is a John Wick joke in the movie.) \n\nThis is the second of three films this summer season to feature Josh Brolin. Cable is less nuanced than Thanos (although, as one might reasonably expect, the screenwriters find a way to make the connection) but he's a credible enough villain when it comes to sowing chaos and, as is hinted at during his opening scene, there's more to the character than meets the eye. Meanwhile, Wade Wilson a.k.a. Deadpool (Ryan Reynolds), after bemoaning a few things about Wolverine's character arc in Logan, tries to blow himself to bits without much success. We see his reasons in a flashback which leads to a deliciously on-target lampoon of a James Bond opening musical number (song courtesy of Celine Dion) complete with Deadpool-inspired fake credits that act as a commentary on the prologue. The story that evolves from there pits Deadpool against Cable, throws in some other Marvel characters, and gives our self-deprecating hero an existential character arc. It's fun stuff, if a little long-winded.\n\nDeadpool 2 sticks to the template established by Deadpool, so the fourth wall isn't much of a barrier. The title character frequently addresses the audience, and the meta references come quickly and frequently. There are a few cameos - including one famous face who appears so quickly (blink and you'll miss him) that I didn't know who he was until the end credits. \n\nIn general, the action sequences are too long and overproduced. That's generally true for comic book movies and explains in large part why these films have such large budgets. What's different about Deadpool 2 is the soundtrack. When was the last time you saw a fight scene choreographed to Dolly Parton's \"9 to 5\"? The film also finds unusual uses for the likes of \"(The Sun'll Come Out) Tomorrow\", \"If I Could Turn Back Time\", \"In Your Eyes\", and \"All Out of Love.\" So, although much of what goes on during the fights is generic, the music gives these lavishly gory slugfests a unique flavor. \n\nThen there's the question of diminishing returns. When asked why the Monty Python troupe never made anything after The Meaning of Life, members answered (among other things) that they were already repeating themselves. The same is true of Deadpool 2. There's only so far a one-joke concept can go and there's a sense, especially late in the proceedings, that the movie is starting to milk it. However, although the film loses momentum in its final half-hour, it more than redeems itself during the end credits. There are two mid-credits scenes (with nothing at the very end) and the second of these may be the most hilarious thing either Deadpool movie has done. It's well worth staying a few extra minutes. \n\nRyan Reynolds is nothing if not committed and, as much as any high-profile actor working today, he's aware of his foibles and willing to make fun of them. That's part of the reason why Deadpool works. With Reynolds' face hidden either by a mask or makeup, Deadpool's charisma emerges from attitude rather than appearance. Also returning from the first film are Morena Baccarin as Vanessa, the love of Deadpool's life; the X-Men pair of Colossus (Stefan Kapicic) and Negasonic Teenage Warhead (Brianna Hildebrand); Blind Al (Leslie Uggams), the woman least likely to be confused with Aunt May; and \"sidekicks\" Weasel (T.J. Miller) and Dopinder (Karan Soni). In addition to Brolin, newcomers include Zazie Beetz (as Domino - no pizza product placement involved), Bill Skarsgard (without clown makeup), Terry Crews (not expendable), Julian Dennison, and a cameo to be named later. \n\nWith Deadpool 2's financial future guaranteed to be well into the black, the filmmakers are talking about a direct sequel (Deadpool 3) and a spin-off (X Force). Too much? Perhaps. For now, however, Deadpool 2 represents a faithful and irreverent continuation of the style and narrative thrust begun in Deadpool. Although not groundbreaking like its predecessor, the movie presents a contrast to serious endeavors like Avengers: Infinity War. The light touch is perfect for a summer breeze.\n\n© 2018 James Berardinelli",
    "trailers": {
        "film_id": 242900,
        "film_name": "Deadpool 2",
        "trailers": {
            "high": [
                {
                    "film_trailer": "https://dzm1iom8kpoas.cloudfront.net/242900_high_V2.mp4",
                    "trailer_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h4.jpg",
                    "version": 2,
                    "quality": "high",
                    "region": "US"
                },
                {
                    "film_trailer": "https://dzm1iom8kpoas.cloudfront.net/242900_high.mp4",
                    "trailer_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h3.jpg",
                    "version": 1,
                    "quality": "high",
                    "region": "US"
                }
            ],
            "med": [
                {
                    "film_trailer": "https://dzm1iom8kpoas.cloudfront.net/242900_med_V2.mp4",
                    "trailer_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h4.jpg",
                    "version": 2,
                    "quality": "med",
                    "region": "US"
                },
                {
                    "film_trailer": "https://dzm1iom8kpoas.cloudfront.net/242900_med.mp4",
                    "trailer_image": "https://d3ltpb4h29tx4j.cloudfront.net/242900/242900h3.jpg",
                    "version": 1,
                    "quality": "med",
                    "region": "US"
                }
            ]
        }
    },
    "genres": [
        {
            "genre_id": 5,
            "genre_name": "Action/Adventure"
        },
        {
            "genre_id": 3,
            "genre_name": "Comedy"
        }
    ],
    "cast": [
        {
            "cast_id": 1876,
            "cast_name": "Ryan Reynolds"
        },
        {
            "cast_id": 5754,
            "cast_name": "Morena Baccarin"
        },
        {
            "cast_id": 1348,
            "cast_name": "Josh Brolin"
        },
        {
            "cast_id": 2492,
            "cast_name": "T.J. Miller"
        },
        {
            "cast_id": 8876,
            "cast_name": "Brianna Hildebrand"
        },
        {
            "cast_id": 23606,
            "cast_name": "Jack Kesy"
        }
    ],
    "directors": [
        {
            "director_id": 4651,
            "director_name": "David Leitch"
        }
    ],
    "producers": [
        {
            "producer_id": 835,
            "producer_name": "Simon Kinberg"
        },
        {
            "producer_id": 7007,
            "producer_name": "Ryan Reynolds"
        },
        {
            "producer_id": 833,
            "producer_name": "Lauren Shuler Donner"
        }
    ],
    "writers": [
        {
            "writer_id": 8371,
            "writer_name": "Rob Liefeld"
        },
        {
            "writer_id": 8372,
            "writer_name": "Fabian Nicieza"
        },
        {
            "writer_id": 6339,
            "writer_name": "Rhett Reese"
        },
        {
            "writer_id": 6338,
            "writer_name": "Paul Wernick"
        }
    ],
    "show_dates": [
        {
            "date": "2018-06-14"
        },
        {
            "date": "2018-06-15"
        },
        {
            "date": "2018-06-16"
        },
        {
            "date": "2018-06-17"
        },
        {
            "date": "2018-06-18"
        },
        {
            "date": "2018-06-19"
        },
        {
            "date": "2018-06-20"
        },
        {
            "date": "2018-06-21"
        }
    ],
    "alternate_versions": [
        {
            "film_id": 269383,
            "film_name": "Deadpool 2: The IMAX 2D Experience",
            "version_type": "IMAX"
        }
    ],
    "status": {
        "state": "OK",
        "code": 1,
        "method": "filmDetails",
        "message": null,
        "request_method": "GET",
        "version": "MONAv102",
        "auth_type": "d"
    }
}